====================================
Function without arguments
====================================
{{ functionName }}
---
(template
  (action
    (function_call
      (identifier))))

====================================
Function with argument
====================================
{{ functionName $ }}
---
(template
  (action
    (function_call
      (identifier)
      (argument_list
        (variable)))))

====================================
Function with arguments
====================================
{{ functionName $ . .Field.Field2 1 }}
---
(template
  (action
    (function_call
      (identifier)
      (argument_list
        (variable)
        (dot)
        (selector_expression
          (field
            (identifier))
          (field_identifier))
        (int_literal)))))

====================================
Method without arguments
====================================
{{ .Method }}
---
(template
  (action
    (field (identifier))))

====================================
Method with argument
====================================
{{ .Method $ }}
---
(template
  (action
    (method_call
      (field
        (identifier))
      (argument_list
        (variable)))))

====================================
Method with arguments
====================================
{{ .Method $ . .Field.Field2 1 }}
---
(template
  (action
    (method_call
      (field
        (identifier))
      (argument_list
        (variable)
        (dot)
        (selector_expression
          (field (identifier))
          (field_identifier))
        (int_literal)))))

====================================
Method on a field without arguments
====================================
{{ .Field.Method }}
---
(template
  (action
    (selector_expression
      (field
        (identifier))
      (field_identifier))))

====================================
Method on a field with arguments
====================================
{{ .Field.Method $ . .Field.Field2 1 }}
---
(template
  (action
    (method_call
      (selector_expression
        (field
          (identifier))
        (field_identifier))
      (argument_list
        (variable)
        (dot)
        (selector_expression
          (field
            (identifier))
          (field_identifier))
        (int_literal)))))

====================================
Selector expression on a parenthesized pipeline
====================================
{{ (pipeline).Field }}
---
(template
  (action
    (selector_expression
      (parenthesized_pipeline
        (function_call
          (identifier)))
      (field_identifier))))
